# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [5,6, 8,14, 15,11]  #4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, StemBlock, [64, 3]],  # 0-P1/2       n 64 320 320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4        n 128 160 160
   [-1, 3, BottleneckCSP, [128]],   #160*160    n 128 160 160
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8        n 128 80  80
   [-1, 9, BottleneckCSP, [256]],  #80*80       n 256 80 80
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16       n 512 40 40
   [-1, 9, BottleneckCSP, [512]], #40*40        n 512 40 40
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32      n 1024 20 20
   [-1, 1, SPP, [1024, [5, 9, 13]]],          # n 1024 20 20
   [-1, 3, BottleneckCSP, [1024, False]],  # 9  n 1024 20 20 
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  #20*20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #40*40
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4  40*40
   [-1, 3, BottleneckCSP, [512, False]],  # 13     40*40

   [-1, 1, Conv, [512, 1, 1]], #40*40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3   80*80
   [-1, 3, BottleneckCSP, [512, False]],  # 17 (P3/8-small)  80*80

   [-1, 1, Conv, [256, 1, 1]], #18  80*80
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #19  160*160
   [-1, 3, BottleneckCSP, [256, False]],  #20  320*320
   [-1, 1, Conv, [256, 1, 1]],  #21  320*320
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #22  320*320
   [[-1, 0], 1, Concat, [1]], #23 cat backbone p2  320*320
   [-1, 3, BottleneckCSP, [256, False]], #24 320*320

   [-1, 1, Conv, [256, 3, 2]],  #25   160*160
   [-1, 1, Conv, [256, 3, 2]],  #26   80*80
   [[-1, 18], 1, Concat, [1]], #27 80*80
   [-1, 3, BottleneckCSP, [256, False]], #28 80*80

   [-1, 1, Conv, [256, 3, 2]], #29  40*40
   [[-1, 14], 1, Concat, [1]],  # 30  cat head P4  40*40
   [-1, 3, BottleneckCSP, [512, False]],  # 31 (P4/16-medium) 40*40

   [-1, 1, Conv, [512, 3, 2]],  #32  20*20
   [[-1, 10], 1, Concat, [1]],  #33 cat head P5  #20*20
   [-1, 3, BottleneckCSP, [1024, False]],  # 34 (P5/32-large)  20*20

   [[24, 28, 30, 34], 1, Detect, [nc, anchors]],  # Detect(p2, P3, P4, P5)
  ]

